reversing/challenge6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Challenge 6</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Challenge 6</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org247b00e">1. Original assembly</a></li>
<li><a href="#org8e5118b">2. Assembly notes</a>
<ul>
<li><a href="#org4dda083">2.1. Local variables</a></li>
<li><a href="#orgdaf6390">2.2. Argument types</a></li>
</ul>
</li>
<li><a href="#org256b10a">3. C translation</a></li>
<li><a href="#org06ca949">4. Optimized version</a></li>
</ul>
</div>
</div>

<div id="outline-container-org247b00e" class="outline-2">
<h2 id="org247b00e"><span class="section-number-2">1.</span> Original assembly</h2>
<div class="outline-text-2" id="text-1">
<p>
Original challenge link: <a href="https://challenges.re/6/">Click me</a>.
</p>

<p>
This challenge had two versions for <code>x86_64</code>, an optimized one and a
non-optimizing one. Let's have a look at the non-optimizing one, size it's
usually easier to reverse.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #4ae2ff;">func</span>:
   <span style="color: #88ca9f;">0</span>:             <span style="color: #feacd0;">push</span>   <span style="color: #6ae4b9;">rbp</span>
   <span style="color: #88ca9f;">1</span>:             <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rbp</span>,<span style="color: #6ae4b9;">rsp</span>
   <span style="color: #88ca9f;">4</span>:             <span style="color: #feacd0;">mov</span>    <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x8</span>], <span style="color: #6ae4b9;">rdi</span>
   <span style="color: #88ca9f;">8</span>:             <span style="color: #feacd0;">mov</span>    <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>], <span style="color: #6ae4b9;">rsi</span>
   <span style="color: #4ae2ff;">c</span>:             <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rax</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x8</span>]
  <span style="color: #88ca9f;">10</span>:             <span style="color: #feacd0;">movzx</span>  <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">BYTE</span> [<span style="color: #6ae4b9;">rax</span>]
  <span style="color: #88ca9f;">13</span>:             <span style="color: #feacd0;">movsx</span>  <span style="color: #6ae4b9;">dx</span>, <span style="color: #6ae4b9;">al</span>
  <span style="color: #88ca9f;">17</span>:             <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rax</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>]
  <span style="color: #88ca9f;">1b</span>:             <span style="color: #feacd0;">mov</span>    <span style="color: #79a8ff;">WORD</span> [<span style="color: #6ae4b9;">rax</span>], <span style="color: #6ae4b9;">dx</span>
  <span style="color: #88ca9f;">1e</span>:             <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rax</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>]
  <span style="color: #88ca9f;">22</span>:             <span style="color: #feacd0;">movzx</span>  <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">WORD</span> [<span style="color: #6ae4b9;">rax</span>]
  <span style="color: #88ca9f;">25</span>:             <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">ax</span>, <span style="color: #6ae4b9;">ax</span>
  <span style="color: #88ca9f;">28</span>:             <span style="color: #feacd0;">jne</span>    <span style="color: #88ca9f;">2c</span>
  <span style="color: #88ca9f;">2a</span>:             <span style="color: #feacd0;">jmp</span>    <span style="color: #88ca9f;">38</span>
  <span style="color: #88ca9f;">2c</span>:             <span style="color: #feacd0;">add</span>    <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x8</span>], <span style="color: #88ca9f;">1</span>
  <span style="color: #88ca9f;">31</span>:             <span style="color: #feacd0;">add</span>    <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>], <span style="color: #88ca9f;">2</span>
  <span style="color: #88ca9f;">36</span>:             <span style="color: #feacd0;">jmp</span>    c
  <span style="color: #88ca9f;">38</span>:             <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">rbp</span>
  <span style="color: #88ca9f;">39</span>:             <span style="color: #feacd0;">ret</span>
</pre>
</div>

<p>
After removing the unused labels, and renaming the used ones.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #4ae2ff;">func</span>:
    <span style="color: #feacd0;">push</span>   <span style="color: #6ae4b9;">rbp</span>
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rbp</span>,<span style="color: #6ae4b9;">rsp</span>
    <span style="color: #feacd0;">mov</span>    <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x8</span>], <span style="color: #6ae4b9;">rdi</span>
    <span style="color: #feacd0;">mov</span>    <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>], <span style="color: #6ae4b9;">rsi</span>
<span style="color: #4ae2ff;">.loop</span>:
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rax</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x8</span>]
    <span style="color: #feacd0;">movzx</span>  <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">BYTE</span> [<span style="color: #6ae4b9;">rax</span>]
    <span style="color: #feacd0;">movsx</span>  <span style="color: #6ae4b9;">dx</span>, <span style="color: #6ae4b9;">al</span>
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rax</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>]
    <span style="color: #feacd0;">mov</span>    <span style="color: #79a8ff;">WORD</span> [<span style="color: #6ae4b9;">rax</span>], <span style="color: #6ae4b9;">dx</span>
    <span style="color: #feacd0;">mov</span>    <span style="color: #6ae4b9;">rax</span>, <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>]
    <span style="color: #feacd0;">movzx</span>  <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">WORD</span> [<span style="color: #6ae4b9;">rax</span>]
    <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">ax</span>, <span style="color: #6ae4b9;">ax</span>
    <span style="color: #feacd0;">jne</span>    .continue
    <span style="color: #feacd0;">jmp</span>    .done
<span style="color: #4ae2ff;">.continue</span>:
    <span style="color: #feacd0;">add</span>    <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x8</span>], <span style="color: #88ca9f;">1</span>
    <span style="color: #feacd0;">add</span>    <span style="color: #79a8ff;">QWORD</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">0x10</span>], <span style="color: #88ca9f;">2</span>
    <span style="color: #feacd0;">jmp</span>    .loop
<span style="color: #4ae2ff;">.done</span>:
    <span style="color: #feacd0;">pop</span>    <span style="color: #6ae4b9;">rbp</span>
    <span style="color: #feacd0;">ret</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e5118b" class="outline-2">
<h2 id="org8e5118b"><span class="section-number-2">2.</span> Assembly notes</h2>
<div class="outline-text-2" id="text-2">
<p>
Important notes for understanding the assembly.
</p>
</div>

<div id="outline-container-org4dda083" class="outline-3">
<h3 id="org4dda083"><span class="section-number-3">2.1.</span> Local variables</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We can see that the function uses local variables because, after preserving the
stack frame, we store the values of <code>rdi</code> and <code>rsi</code> (the two function arguments)
into <code>[rbp - N]</code>. Keep in mind that the stack grows downwards, so the stack layout
(relative to <code>RBP</code>) would be the following:
</p>

<pre class="example" id="orgc2d67ac">
+-----+-------+------+---------+---------+----------------+-----+
|     | -0x10 | -0x8 |   RBP   |  +0x8   |     +0x10      |     |
|-----+-------+------+---------+---------+----------------+-----|
| ... | RSI   | RDI  | Old RSP | Old RBP | Return address | ... |
+-----+-------+------+---------+---------+----------------+-----+
</pre>
</div>
</div>

<div id="outline-container-orgdaf6390" class="outline-3">
<h3 id="orgdaf6390"><span class="section-number-3">2.2.</span> Argument types</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Just like in <a href="challenge5.html">challenge 5</a>, we can conclude that the type of the first argument
(<code>rdi</code>) is a <code>char*</code> because of the <code>BYTE [...]</code> operations.
</p>

<p>
We can also asume that the second argument, <code>rsi</code> is a <code>int16_t</code> pointer because
after moving it to <code>[rbp - 0x10]</code>, and then to <code>rax</code>, it's accessing its contents
with <code>WORD [...]</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org256b10a" class="outline-2">
<h2 id="org256b10a"><span class="section-number-2">3.</span> C translation</h2>
<div class="outline-text-2" id="text-3">
<p>
Following the strategy used in <a href="challenge5.html">challenge 5</a>, I will start by translating the
assembly into simple C pseudo-code, and trying to improve the code and symbol
names from there.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #79a8ff;">int</span> <span style="color: #4ae2ff;">func</span>(<span style="color: #79a8ff;">char</span>* <span style="color: #6ae4b9;">rdi</span>, <span style="color: #79a8ff;">int16_t</span>* <span style="color: #6ae4b9;">rsi</span>) {
    <span style="color: #79a8ff;">char</span>* <span style="color: #6ae4b9;">var8</span>     = rdi;
    <span style="color: #79a8ff;">int16_t</span>* <span style="color: #6ae4b9;">var10</span> = rsi;

    <span style="color: #ff6f9f;">for</span> (;;) {
        <span style="color: #79a8ff;">char</span>* <span style="color: #6ae4b9;">rax0</span> = var8;
        <span style="color: #79a8ff;">int16_t</span> <span style="color: #6ae4b9;">dx</span> = *rax0;

        <span style="color: #79a8ff;">int16_t</span>* <span style="color: #6ae4b9;">rax1</span> = var10;
        *rax          = dx;

        <span style="color: #79a8ff;">int16_t</span>* <span style="color: #6ae4b9;">rax2</span> = var10;
        <span style="color: #79a8ff;">int16_t</span> <span style="color: #6ae4b9;">ax</span>    = *rax;

        <span style="color: #ff6f9f;">if</span> (ax == <span style="color: #88ca9f;">0</span>)
            <span style="color: #ff6f9f;">break</span>;

        var8++;
        var10++; <span style="color: #989898;">/* </span><span style="color: #989898;">Incrementing 2 bytes, 1 word</span><span style="color: #989898;"> */</span>
    }
}
</pre>
</div>

<p>
After changing the symbol names, and optimizing.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #79a8ff;">int</span> <span style="color: #4ae2ff;">func</span>(<span style="color: #79a8ff;">char</span>* <span style="color: #6ae4b9;">a</span>, <span style="color: #79a8ff;">int16_t</span>* <span style="color: #6ae4b9;">b</span>) {
    <span style="color: #ff6f9f;">for</span> (;;) {
        <span style="color: #989898;">/* </span><span style="color: #989898;">Extend byte to word</span><span style="color: #989898;"> */</span>
        *b = (<span style="color: #79a8ff;">int16_t</span>)*a;

        <span style="color: #ff6f9f;">if</span> (*b == <span style="color: #88ca9f;">0</span>)
            <span style="color: #ff6f9f;">break</span>;

        a++;
        b++;
    }
}
</pre>
</div>

<p>
As we can see, it's a function for copying the zero-terminated bytes in a <code>char*</code>
to a <code>int16_t</code> array.
</p>

<p>
We can't put the condition directly in the loop, because according to the
assembly, it always transfers the byte, before checking if it's zero.
</p>
</div>
</div>

<div id="outline-container-org06ca949" class="outline-2">
<h2 id="org06ca949"><span class="section-number-2">4.</span> Optimized version</h2>
<div class="outline-text-2" id="text-4">
<p>
Now, let's compare it to the optimized version provided in the website. I
changed the label names again.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #4ae2ff;">func</span>:
    <span style="color: #feacd0;">jmp</span>    .loop
    <span style="color: #feacd0;">nop</span>    <span style="color: #79a8ff;">WORD</span> [<span style="color: #6ae4b9;">rax</span> + <span style="color: #6ae4b9;">rax</span> * <span style="color: #88ca9f;">1</span> + <span style="color: #88ca9f;">0x0</span>]
<span style="color: #4ae2ff;">.continue</span>:
    <span style="color: #feacd0;">add</span>    <span style="color: #6ae4b9;">rdi</span>, <span style="color: #88ca9f;">1</span>
    <span style="color: #feacd0;">add</span>    <span style="color: #6ae4b9;">rsi</span>, <span style="color: #88ca9f;">2</span>
<span style="color: #4ae2ff;">.loop</span>:
    <span style="color: #feacd0;">movsx</span>  <span style="color: #6ae4b9;">ax</span>, <span style="color: #79a8ff;">BYTE</span> [<span style="color: #6ae4b9;">rdi</span>]
    <span style="color: #feacd0;">test</span>   <span style="color: #6ae4b9;">ax</span> , <span style="color: #6ae4b9;">ax</span>
    <span style="color: #feacd0;">mov</span>    <span style="color: #79a8ff;">WORD</span> [<span style="color: #6ae4b9;">rsi</span>], <span style="color: #6ae4b9;">ax</span>
    <span style="color: #feacd0;">jne</span>    .continue
    <span style="color: #feacd0;">repz</span>   <span style="color: #feacd0;">ret</span>
    <span style="color: #feacd0;">xchg</span>   <span style="color: #6ae4b9;">ax</span>,<span style="color: #6ae4b9;">ax</span>
</pre>
</div>

<p>
Note how it doesn't use any local variables in the stack now, and uses the <code>rdi</code>
and <code>rsi</code> registers directly.
</p>

<p>
Some important notes about <code>nop</code> and <code>xchg</code>:
</p>

<ol class="org-ol">
<li>The <a href="https://www.felixcloutier.com/x86/nop">nop</a> instruction performs no operation.</li>
<li>You can also use it with operands, making it a <b>multi-byte NOP instruction</b>,
which doesn't alter it's behavior, but takes up more bytes.</li>
<li>The <a href="https://www.felixcloutier.com/x86/xchg">xchg</a> instruction exchanges values.</li>
<li>The <code>nop</code> instruction is an alias mnemonic for the <code>xchg (e)ax, (e)ax</code>
instruction. Exchanging something with itself, does nothing.</li>
</ol>

<p>
The first thing the function does is jump to <code>.loop</code>, which moves the value at
<code>*rdi</code> to <code>ax</code>, the lower 16 bits of <code>rax</code>. Then, it checks if <code>ax</code> is zero with the
<code>test</code> instruction, but <b>before</b> branching, it copies the value into <code>*rsi</code>. Then it
can branch to <code>.continue</code> depending on if <code>ax</code> was zero or not.
</p>

<p>
Once <code>ax</code> is zero, it will not jump and continue with the next instruction, which
is <code>repz ret</code>.
</p>

<blockquote>
<p>
<b>REP/REPE/REPZ/REPNE/REPNZ — Repeat String Operation Prefix</b>
</p>

<p>
Repeats a string instruction the number of times specified in the count register
or until the indicated condition of the ZF flag is no longer met.
</p>
</blockquote>

<p>
So we are&#x2026; returning while the counter register (<code>rcx</code>) is zero? Of course this
didn't make sense to me, so I searched around and came across <a href="https://repzret.org/p/repzret/">repzret.org</a>, which
definitely looked interesting. From there, we can read:
</p>

<blockquote>
<p>
A two-byte <code>ret</code> has a <code>rep</code> instruction inserted before the <code>ret</code>, which produces the
functional equivalent of the single-byte near-return <code>ret</code> instruction.
</p>

<p>
This form is preferred to the simple <code>ret</code> either when it is the target of any
kind of branch, conditional (<code>jne/je/...</code>) or unconditional (<code>jmp/call/...</code>), or
when it directly follows a conditional branch.
</p>

<p>
Basically, when the next instruction after a branch is a <code>ret</code>, whether the branch
was taken or not, it should have a <code>rep</code> prefix.
</p>

<p>
Why? Because "The processor is unable to apply a branch prediction to the
single-byte near-return form (opcode <code>0xC3</code>) of the <code>ret</code> instruction." Thus, "Use
of a two-byte near-return can improve performance".
</p>
</blockquote>

<p>
The article has more information about branch prediction, so I would recommend
checking it out.
</p>
</div>
</div>
</div>
</body>
</html>
